#!/usr/bin/env python3
import os
import sys

from modules.basic import basic_recon
from modules.whois import whois_lookup
from modules.dns import dns_lookup

def banner():
    os.system("clear")
    print("""
███████╗██╗  ██╗ █████╗ ████████╗████████╗███████╗██████╗ ███╗   ███╗██╗███╗   ██╗██████╗
██╔════╝██║  ██║██╔══██╗╚══██╔══╝╚══██╔══╝██╔════╝██╔══██╗████╗ ████║██║████╗  ██║██╔══██╗
███████╗███████║███████║   ██║      ██║   █████╗  ██████╔╝██╔████╔██║██║██╔██╗ ██║██║  ██║
╚════██║██╔══██║██╔══██║   ██║      ██║   ██╔══╝  ██╔══██╗██║╚██╔╝██║██║██║╚██╗██║██║  ██║
███████║██║  ██║██║  ██║   ██║      ██║   ███████╗██║  ██║██║ ╚═╝ ██║██║██║ ╚████║██████╔╝
╚══════╝╚═╝  ╚═╝╚═╝  ╚═╝   ╚═╝      ╚═╝   ╚══════╝╚═╝  ╚═╝╚═╝     ╚═╝╚═╝╚═╝  ╚═══╝╚═════╝

        SHATTERMIND - Recon Framework
""")

def menu():
    print("""
[1] Basic Recon
[2] Whois Lookup
[3] DNS Lookup
[0] Exit
""")

def main():
    banner()

    while True:
        menu()
        choice = input("shattermind> ")

        if choice == "1":
            target = input("Enter domain (no http): ")
            basic_recon(target)

        elif choice == "2":
            target = input("Enter domain: ")
            whois_lookup(target)

        elif choice == "3":
            target = input("Enter domain: ")
            dns_lookup(target)

        elif choice == "0":
            print("Goodbye 👋")
            sys.exit()

        else:
            print("Invalid option")

if __name__ == "__main__":
    main()
